Autodesk.Revit.DB.Structure.FabricSheetType.MinorDirectionWireType
The id of the FabricWireType to be used in the minor direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the ElementId minorDirectionWireType is either invalid or not a FabricWireType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MajorDirectionWireType
The id of the FabricWireType to be used in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the ElementId majorDirectionWireType is either invalid or not a FabricWireType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013